---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarContainerOutSideOfHostWarning
source: html/63eda61d-558b-b19c-6808-9dcea26f05b8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarContainerOutSideOfHostWarning Property

Rebar Container is placed completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarContainerOutSideOfHostWarning { get; }
```